_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_BIM_СоответствиеОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_BIM_СоответствиеОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шифр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНормативногоСборника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыНормативныхСборников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторВМодели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательДляРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШифрРодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНормативногоСборникаРодителя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыНормативныхСборников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_BIM_ХарактеристикиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_BIM_ХарактеристикиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеЧислом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Конструктив</v8:Type>
						<v8:Type>cfg:CatalogRef.СМ_BIM_ТипыКонструктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторВМодели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательДляРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыНормативныхСборников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыНормативныхСборников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтроительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПусконаладочныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РемонтноСтроительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеставрационноВосстановительныеРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническоеОбслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СметныеЦеныНаМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СметныеЦеныНаЭксплуатациюМашин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогШтучныхКонструкций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прейскурант0608НаСборныйЖелезобетон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрейскурантыНаРемонтТехнологическогоОборудования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрейскурантОптовыхЦенНаМатериалыИОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦеныНаМестныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УкрупненныеСметныеНормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перебазировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеЗатратыВЗимнееВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СодержаниеОбъектовГородскойСреды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременныеЗданияИСооружения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Калькуляция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыМатериалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учтенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчтенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестныйМатериал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_ОбъектыСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_ОбъектыСтроительства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОбъектаСтроительства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураГенподрядчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМесячныеПланы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНедельноСуточныеПланы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураРаботЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиЗаполнятьПлановыйРасходМатериалов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьФактРаботыВодителейТехникиПутевымиЛистами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовМатериалы</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовИсполнители</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовМеханизмы</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НумераторСмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_НумераторыСмет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПроектMSP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НумераторОбъектныхСмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_НумераторыСмет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_214ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ВестиРаспределениеМатериаловПоРаботам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НумераторСводныхСмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_НумераторыСмет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_НоменклатураДляЗаказаПереработчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ОбъектСтроительстваERP</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСОERP_ИндекснаяСтраницаWebKit</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиСтроительства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_РолиУчастниковСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/WebServices/CM_BIM/Ext/Module.bsl
#Область Методы

Функция SetDataList(Data)
	
	Действие=Data.Action;
	
	ОбъектСтроительства = СМ_BIM_ВызовСервера.ПолучитьОбъектСтроительства(Data.BuildingObject);
	                 	
	Если Действие="SetPosition" Тогда
		
		Попытка
			ТаблицаСоответствий=ПреобразоватьПараметрыСоответствияВТаблицуЗначений(ОбъектСтроительства,Data.bimRequestList,Data.BuildingObject);		
			
			Для Каждого СтрокаПараметров Из ТаблицаСоответствий Цикл
				Запись=РегистрыСведений.СМ_BIM_СоответствиеОбъектов.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись,СтрокаПараметров);
				Запись.Записать();
			КонецЦикла;
			return "Ok";
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'СМ_BIM WS'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при записи соответствия");
			return "Write/read error";
		КонецПопытки;      		
		
	ИначеЕсли Действие="DelPosition" Тогда
		
		Попытка
			ТаблицаСоответствий=ПреобразоватьПараметрыСоответствияВТаблицуЗначений(ОбъектСтроительства,Data.bimRequestList,Data.BuildingObject);		
			
			Для Каждого СтрокаПараметров Из ТаблицаСоответствий Цикл
				Запись=РегистрыСведений.СМ_BIM_СоответствиеОбъектов.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись,СтрокаПараметров);
				Запись.Прочитать();
				Запись.Удалить();
			КонецЦикла;
			return "Ok";
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'СМ_BIM WS'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при записи соответствия");
			return "Write/read error";
		КонецПопытки;
		
	ИначеЕсли Действие="SaveParam" Тогда
		
		Попытка
			ТаблицаХарактеристик= ПреобразоватьХарактеристикиВТаблицуЗначений(ОбъектСтроительства,Data.bimRequestList,Data.BuildingObject);
			Для Каждого СтрокаПараметров Из ТаблицаХарактеристик Цикл
				Запись=РегистрыСведений.СМ_BIM_ХарактеристикиОбъектов.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись,СтрокаПараметров);
				Запись.Записать();
			КонецЦикла;
			return "Ok";
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'СМ_BIM WS'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при записи соответствия");
			return "Write/read error";
		КонецПопытки;
		
	КонецЕсли;
	
	return "Action no find";
	
КонецФункции

Функция GetDataList(Data)
	
	Запрос=новый Запрос;	
	Если Data.ParamName="root" Тогда	
		// Не используется.
		Запрос.Текст="ВЫБРАТЬ
		|	СМ_НормативныеСборники.Ссылка КАК Code,
		|	СМ_НормативныеСборники.Наименование КАК Name,
		|	СМ_НормативныеСборники.Родитель КАК StGroup,
		|	ЕСТЬNULL(СМ_НормативныеСборники.ЕдиницаИзмерения.Наименование, """") КАК Metric,
		|	ЕСТЬNULL(СМ_НормативныеСборники.КодНормативнойРасценки, """") КАК Key,
		|	СМ_НормативныеСборники.ТипНормативногоСборника
		|ИЗ
		|	Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
		|ГДЕ
		|	СМ_НормативныеСборники.Родитель.Код ЕСТЬ NULL 
		|	И НЕ СМ_НормативныеСборники.ПометкаУдаления";
		
		Результат=Запрос.Выполнить().Выгрузить();	
		
		ТипСтрока = ФабрикаXDTO.Тип("bimPack","bimStandard");
		ТипТаблица = ФабрикаXDTO.Тип("bimPack","bimStandardList");
		Таблица = ФабрикаXDTO.Создать(ТипТаблица);
		Для Каждого Стр Из результат Цикл
			Строка = ФабрикаXDTO.Создать(ТипСтрока);
			Строка.Name=Стр.Name;
			Строка.Metric=Стр.Metric;
			Строка.Key=Стр.Key;
			Строка.Code=Строка(Стр.Code.УникальныйИдентификатор());
			Строка.StGroup=Строка(Стр.StGroup.УникальныйИдентификатор());
			Строка.TypeLink="";
			Строка.ParamId="";
			Строка.Book=Строка(Стр.ТипНормативногоСборника);
			Таблица.bimStandard.Добавить(Строка);
		КонецЦикла;
		
	ИначеЕсли Data.paramName="uid" Тогда	
		
		// Не используется.
		Запрос.Текст="ВЫБРАТЬ
		|	СМ_НормативныеСборники.Ссылка КАК Code,
		|	СМ_НормативныеСборники.Наименование КАК Name,
		|	СМ_НормативныеСборники.Родитель КАК StGroup,
		|	ЕСТЬNULL(СМ_НормативныеСборники.ЕдиницаИзмерения.Наименование, """") КАК Metric,
		|	ЕСТЬNULL(СМ_НормативныеСборники.КодНормативнойРасценки, """") КАК Key,
		|	СМ_НормативныеСборники.ТипНормативногоСборника
		|ИЗ
		|	Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
		|ГДЕ
		|	СМ_НормативныеСборники.Родитель = &Ссылка
		|	И НЕ СМ_НормативныеСборники.ПометкаУдаления ";
		
		Ссылка = XMLЗначение(ИзXMLТипа(XMLТипЗнч(Справочники.СМ_НормативныеСборники.ПустаяСсылка())), Data.paramValue);	
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		Результат=Запрос.Выполнить().Выгрузить();	
		ТипСтрока = ФабрикаXDTO.Тип("bimPack","bimStandard");
		ТипТаблица = ФабрикаXDTO.Тип("bimPack","bimStandardList");
		Таблица = ФабрикаXDTO.Создать(ТипТаблица);
		
		Для Каждого Стр Из Результат Цикл
			Строка = ФабрикаXDTO.Создать(ТипСтрока);
			Строка.Name=Стр.Name;
			Строка.Metric=Стр.Metric;
			Строка.Key=Стр.Key;
			Строка.Code=Строка(Стр.Code.УникальныйИдентификатор());
			Строка.StGroup=Строка(Стр.StGroup.УникальныйИдентификатор());
			Строка.TypeLink="";
			Строка.ParamId="";
			Строка.Book=Строка(Стр.ТипНормативногоСборника);
			Таблица.bimStandard.Добавить(Строка);
		КонецЦикла;
		
	ИначеЕсли 	Data.paramName="search" Тогда
		
		// Не используется.
		Стр=Data.paramValue;
		СтрМас=СтрЗаменить(Стр," ",Символы.ПС);
		Усл="";
		Для Сч=1 По СтрЧислоСтрок(СтрМас) Цикл
			Слово=СокрЛП(СтрПолучитьстроку(СтрМас,СЧ));
			Если СтрДлина(Слово)=0 Тогда Продолжить; КонецЕсли;
			Усл=Усл+" И (Наименование ПОДОБНО ""%"+Слово+"%"" ИЛИ КодНормативнойРасценки ПОДОБНО ""%"+Слово+"%"")";
		КонецЦикла;
		
		
		СхемаКомпоновкиДанных = ПолучитьМакетДляПоиска(Усл);
		
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
		Результат = Новый ТаблицаЗначений;
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(Результат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		ТипСтрока = ФабрикаXDTO.Тип("bimPack","bimStandard");
		ТипТаблица = ФабрикаXDTO.Тип("bimPack","bimStandardList");
		Таблица = ФабрикаXDTO.Создать(ТипТаблица);
		
		Для Каждого Стр Из Результат Цикл
			Строка = ФабрикаXDTO.Создать(ТипСтрока);
			Строка.Name=Стр.Name;
			Строка.Metric=Стр.Metric;
			Строка.Key=Стр.Key;
			Строка.Code=Строка(Стр.Code.УникальныйИдентификатор());
			Если ЗначениеЗаполнено(Стр.StGroup) Тогда
				Строка.StGroup=Строка(Стр.StGroup.УникальныйИдентификатор());
			ИначеЕсли ЗначениеЗаполнено(Стр.Code) Тогда
				Строка.StGroup=Строка(Стр.Code.Родитель.УникальныйИдентификатор());
			Иначе 
				Строка.StGroup="";
			КОнецесли;
			Строка.TypeLink="";
			Строка.ParamId="";
			Строка.Book=Строка(Стр.ТипНормативногоСборника);
			Таблица.bimStandard.Добавить(Строка);
		КонецЦикла;
		
	ИначеЕсли Data.paramName="obid" Тогда
		
		Запрос.Текст="ВЫБРАТЬ
		             |	СМ_НормативныеСборники.Ссылка КАК Code,
		             |	СМ_НормативныеСборники.Наименование КАК Name,
		             |	СМ_НормативныеСборники.Родитель КАК StGroup,
		             |	ЕСТЬNULL(СМ_НормативныеСборники.ЕдиницаИзмерения.Наименование, """") КАК Metric,
		             |	ЕСТЬNULL(СМ_НормативныеСборники.КодНормативнойРасценки, """") КАК Key,
		             |	СМ_НормативныеСборники.ТипНормативногоСборника,
		             |	СМ_BIM_СоответствиеОбъектов.ПоказательДляРасчета КАК TypeLink,
		             |	СМ_BIM_СоответствиеОбъектов.ИдентификаторВМодели КАК ParamId,
		             |	СМ_BIM_СоответствиеОбъектов.ИдентификаторРесурса КАК ParamMaterialId,
		             |	СМ_BIM_СоответствиеОбъектов.ШифрРодителя КАК KeyParent,
		             |	СМ_BIM_СоответствиеОбъектов.ТипНормативногоСборникаРодителя КАК BookParent
		             |	
		             |ИЗ
		             |	Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СМ_BIM_СоответствиеОбъектов КАК СМ_BIM_СоответствиеОбъектов
		             |		ПО СМ_НормативныеСборники.КодНормативнойРасценки = СМ_BIM_СоответствиеОбъектов.Шифр
		             |			И СМ_НормативныеСборники.ТипНормативногоСборника = СМ_BIM_СоответствиеОбъектов.ТипНормативногоСборника
		             |			И (СМ_BIM_СоответствиеОбъектов.ОбъектСтроительства = &ОбъектСтроительства)
		             |			И (СМ_BIM_СоответствиеОбъектов.ИдентификаторПроекта = &ИдентификаторПроекта)
		             |			И (СМ_BIM_СоответствиеОбъектов.ИдентификаторВМодели <> ""File"")
		             |			И (СМ_НормативныеСборники.КодНормативнойРасценки <> """") //%ТЕКСТИД%
		             |ГДЕ
		             |	НЕ СМ_НормативныеСборники.ПометкаУдаления ";
		
		СписокНормативов = Новый СписокЗначений();
		Если ЗначениеЗаполнено(Data.paramid) Тогда
			Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Data.paramid, "%", Истина);
			СписокНормативов = Новый СписокЗначений();
			СписокНормативов.ЗагрузитьЗначения(Массив);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "//%ТЕКСТИД%", " И (СМ_BIM_СоответствиеОбъектов.ИдентификаторВМодели В (&ИдентификаторыВМодели))");
			Запрос.УстановитьПараметр("ИдентификаторыВМодели",СписокНормативов);				
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ОбъектСтроительства", СМ_BIM_ВызовСервера.ПолучитьОбъектСтроительства(Data.paramValue));	
		Запрос.УстановитьПараметр("ИдентификаторПроекта",Data.paramValue);
		Результат=Запрос.Выполнить().Выгрузить();	
		ТипСтрока = ФабрикаXDTO.Тип("bimPack","bimStandard");
		ТипТаблица = ФабрикаXDTO.Тип("bimPack","bimStandardList");
		Таблица = ФабрикаXDTO.Создать(ТипТаблица);
		Для Каждого Стр Из результат Цикл
			Строка = ФабрикаXDTO.Создать(ТипСтрока);
			Строка.Name=Стр.Name;
			Строка.Metric=Стр.Metric;
			Строка.Key=Стр.Key;
			Строка.Code=Строка(Стр.Code.УникальныйИдентификатор());
			Строка.StGroup=Строка(Стр.StGroup.УникальныйИдентификатор());
			Строка.TypeLink=Стр.TypeLink;
			Строка.ParamId=Стр.ParamId;
			Строка.Book=Строка(Стр.ТипНормативногоСборника);
			Строка.KeyParent=Стр.KeyParent;
			Строка.BookParent=Строка(Стр.BookParent);
			Строка.ParamMaterialId=Стр.ParamMaterialId;
			Таблица.bimStandard.Добавить(Строка);
		КонецЦикла;	
		
	ИначеЕсли  Data.paramName="build" Тогда
		
		Запрос.Текст="ВЫБРАТЬ
		|	Вт.Ссылка КАК Code,
		|	Вт.Наименование КАК Name,
		|	Вт.Родитель КАК StGroup
		|ИЗ
		|	Справочник.СМ_ОбъектыСтроительства КАК Вт
		|ГДЕ
		|	НЕ Вт.ПометкаУдаления";
		Результат=Запрос.Выполнить().Выгрузить();	
		ТипСтрока = ФабрикаXDTO.Тип("bimPack","bimStandard");
		ТипТаблица = ФабрикаXDTO.Тип("bimPack","bimStandardList");
		Таблица = ФабрикаXDTO.Создать(ТипТаблица);
		Для Каждого Стр Из результат Цикл
			Строка = ФабрикаXDTO.Создать(ТипСтрока);
			Строка.Name=Стр.Name;
			Строка.Metric="";
			Строка.Key="";
			Строка.Code=Строка(Стр.Code.УникальныйИдентификатор());
			Строка.StGroup=Строка(Стр.StGroup.УникальныйИдентификатор());
			Строка.TypeLink="";
			Строка.ParamId="";
			Строка.Book="";
			Таблица.bimStandard.Добавить(Строка);
		КонецЦикла;
		
	ИначеЕсли (Data.paramName="all_types") Или (Data.paramName="types") Тогда
		
		Запрос.Текст="ВЫБРАТЬ
		             |	СМ_BIM_НормативныеСборникиТипыЭлементовМодели.НормативныйСборник КАК Code,
		             |	СМ_BIM_НормативныеСборникиТипыЭлементовМодели.НормативныйСборник.Наименование КАК Name,
		             |	СМ_BIM_НормативныеСборникиТипыЭлементовМодели.НормативныйСборник.ТипНормативногоСборника КАК Book,
		             |	СМ_BIM_НормативныеСборникиТипыЭлементовМодели.НормативныйСборник.Родитель КАК StGroup,
		             |	ЕСТЬNULL(СМ_BIM_НормативныеСборникиТипыЭлементовМодели.НормативныйСборник.ЕдиницаИзмерения.Наименование, """") КАК Metric,
		             |	ЕСТЬNULL(СМ_BIM_НормативныеСборникиТипыЭлементовМодели.НормативныйСборник.КодНормативнойРасценки, """") КАК Key,
		             |	СМ_BIM_НормативныеСборникиТипыЭлементовМодели.ТипЭлемента.Ссылка КАК ТипЭлемента,
		             |	СМ_BIM_НормативныеСборникиТипыЭлементовМодели.ТипЭлемента.ИдентификаторРенга КАК ParamId,
		             |	СМ_BIM_НормативныеСборникиТипыЭлементовМодели.ТипЭлемента.ИмяКлассаРенга КАК ИмяКлассаРенга
		             |ИЗ
		             |	РегистрСведений.СМ_BIM_НормативныеСборникиТипыЭлементовМодели КАК СМ_BIM_НормативныеСборникиТипыЭлементовМодели";
		
		Если (Data.paramName="types") И ЗначениеЗаполнено(Data.ParamValue) Тогда
			Запрос.Текст=Запрос.Текст+" ГДЕ СМ_BIM_НормативныеСборникиТипыЭлементовМодели.НормативныйСборник = &Ссылка";	
			Запрос.УстановитьПараметр("Ссылка", Data.ParamValue);
		КонецЕсли;
		Результат=Запрос.Выполнить().Выгрузить();	
		ТипСтрока = ФабрикаXDTO.Тип("bimPack","bimStandard");
		ТипТаблица = ФабрикаXDTO.Тип("bimPack","bimStandardList");
		Таблица = ФабрикаXDTO.Создать(ТипТаблица);
		Для Каждого Стр Из результат Цикл
			Строка = ФабрикаXDTO.Создать(ТипСтрока);
			Строка.Name=Стр.Name;
			Строка.Metric=Стр.Metric;
			Строка.Key=Стр.Key;
			Строка.Code=Строка(Стр.Code.УникальныйИдентификатор());
			Строка.StGroup=Строка(Стр.StGroup.УникальныйИдентификатор());
			Строка.TypeLink="";
			Строка.ParamId=Стр.ParamId;
			Строка.Book=Строка(Стр.Book);
			Строка.KeyParent="";
			Строка.BookParent="";
			Строка.ParamMaterialId="";
			Таблица.bimStandard.Добавить(Строка);
		КонецЦикла;
		
	Иначе 
		
		Запрос.Текст="ВЫБРАТЬ
		             |	СМ_НормативныеСборники.Ссылка КАК Code,
		             |	ЕСТЬNULL(СМ_НормативныеСборники.Наименование, """") КАК Name,
		             |	ЕСТЬNULL(СМ_НормативныеСборники.Родитель, """") КАК StGroup,
		             |	ЕСТЬNULL(СМ_НормативныеСборники.ЕдиницаИзмерения.Наименование, """") КАК Metric,
		             |	ЕСТЬNULL(СМ_НормативныеСборники.КодНормативнойРасценки, """") КАК Key,
		             |	СМ_НормативныеСборники.ТипНормативногоСборника КАК ТипНормативногоСборника,
		             |	0 КАК НомерСтроки,
		             |	ВЫБОР
		             |		КОГДА СМ_НормативныеСборники.ЭтоГруппа
		             |			ТОГДА ""GROUP""
		             |		ИНАЧЕ ""NORM""
		             |	КОНЕЦ КАК TypeLink
		             |ИЗ
		             |	Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
		             |ГДЕ
		             |	НЕ СМ_НормативныеСборники.ПометкаУдаления
		             |
		             |ОБЪЕДИНИТЬ ВСЕ
		             |
		             |ВЫБРАТЬ
		             |	СМ_НормативныеСборникиРесурсыНормативныхСборников.Ссылка,
		             |	ВЫБОР
		             |		КОГДА ЕСТЬNULL(СМ_НормативныеСборникиРесурсыНормативныхСборников.НаименованиеРесурса, """") = """"
		             |			ТОГДА СМ_НормативныеСборникиРесурсыНормативныхСборников.Ресурс.Наименование
		             |		ИНАЧЕ ЕСТЬNULL(СМ_НормативныеСборникиРесурсыНормативныхСборников.НаименованиеРесурса, """")
		             |	КОНЕЦ,
		             |	СМ_НормативныеСборникиРесурсыНормативныхСборников.Ссылка,
		             |	ВЫБОР
		             |		КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(СМ_НормативныеСборникиРесурсыНормативныхСборников.ЕдиницаИзмеренияРесурса КАК СТРОКА(50)), """") = """"
		             |			ТОГДА СМ_НормативныеСборникиРесурсыНормативныхСборников.Ресурс.ЕдиницаИзмерения.Наименование
		             |		ИНАЧЕ СМ_НормативныеСборникиРесурсыНормативныхСборников.ЕдиницаИзмеренияРесурса
		             |	КОНЕЦ,
		             |	ВЫБОР
		             |		КОГДА ЕСТЬNULL(СМ_НормативныеСборникиРесурсыНормативныхСборников.КодРесурса, """") = """"
		             |			ТОГДА СМ_НормативныеСборникиРесурсыНормативныхСборников.Ресурс.Код
		             |		ИНАЧЕ СМ_НормативныеСборникиРесурсыНормативныхСборников.КодРесурса
		             |	КОНЕЦ,
		             |	ЗНАЧЕНИЕ(Перечисление.СМ_ТипыНормативныхСборников.СметныеЦеныНаМатериалы),
		             |	СМ_НормативныеСборникиРесурсыНормативныхСборников.НомерСтроки,
		             |	""RESOURCE""
		             |ИЗ
		             |	Справочник.СМ_НормативныеСборники.РесурсыНормативныхСборников КАК СМ_НормативныеСборникиРесурсыНормативныхСборников
		             |ГДЕ
		             |	СМ_НормативныеСборникиРесурсыНормативныхСборников.Ссылка.ПометкаУдаления = ЛОЖЬ
		             |	И СМ_НормативныеСборникиРесурсыНормативныхСборников.ТипРесурса <> ЗНАЧЕНИЕ(Перечисление.СМ_ТипыМатериалов.Учтенный)";
		Результат=Запрос.Выполнить().Выгрузить();	
		ТипСтрока = ФабрикаXDTO.Тип("bimPack","bimStandard");
		ТипТаблица = ФабрикаXDTO.Тип("bimPack","bimStandardList");
		Таблица = ФабрикаXDTO.Создать(ТипТаблица);
		Для Каждого Стр Из Результат Цикл
			Если Стр.Name<>NULL  Тогда
				Строка = ФабрикаXDTO.Создать(ТипСтрока);
				Строка.Name=?(Стр.Name<>NULL,Стр.Name,"");
				Строка.Metric=Стр.Metric;
				Строка.Key=Стр.Key;
				Строка.Code=Строка(Стр.Code.УникальныйИдентификатор())+?(Стр.НомерСтроки>0, "#"+Формат(Стр.НомерСтроки,"ЧГ=0"), "");
				Строка.StGroup=Строка(Стр.StGroup.УникальныйИдентификатор());
				Строка.TypeLink=Стр.TypeLink;
				Строка.ParamId="";
				Строка.Book=Строка(Стр.ТипНормативногоСборника);
				Таблица.bimStandard.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;	
	
	
	Возврат Таблица;
	
	
КонецФункции

Функция GetDataListById(Data)
	
	ОбъектСтроительства = СМ_BIM_ВызовСервера.ПолучитьОбъектСтроительства(Data.BuildingObject);
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СМ_НормативныеСборники.Ссылка КАК Code,
	|	СМ_НормативныеСборники.Наименование КАК Name,
	|	СМ_НормативныеСборники.Родитель КАК StGroup,
	|	ЕСТЬNULL(СМ_НормативныеСборники.ЕдиницаИзмерения.Наименование, """") КАК Metric,
	|	ЕСТЬNULL(СМ_НормативныеСборники.КодНормативнойРасценки, """") КАК Key,
	|	СМ_НормативныеСборники.ТипНормативногоСборника,
	|	СМ_BIM_СоответствиеОбъектов.ПоказательДляРасчета КАК TypeLink,
	| СМ_BIM_СоответствиеОбъектов.ИдентификаторВМодели КАК ParamId
	|ИЗ
	|	Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СМ_BIM_СоответствиеОбъектов КАК СМ_BIM_СоответствиеОбъектов
	|		ПО СМ_НормативныеСборники.КодНормативнойРасценки = СМ_BIM_СоответствиеОбъектов.Шифр
	|			И СМ_НормативныеСборники.ТипНормативногоСборника = СМ_BIM_СоответствиеОбъектов.ТипНормативногоСборника
	|			И (&НеЗаполнено
	|				ИЛИ СМ_BIM_СоответствиеОбъектов.ИдентификаторВМодели В (&ИдентификаторВМодели))
	|			И (СМ_BIM_СоответствиеОбъектов.ОбъектСтроительства = &ОбъектСтроительства)
	|			И (СМ_BIM_СоответствиеОбъектов.ИдентификаторПроекта = &ИдентификаторПроекта)
	|ГДЕ
	|	НЕ СМ_НормативныеСборники.ПометкаУдаления";
	
	МассивЭлементов=Новый Массив;
	Для Каждого СтрокаПараметров Из Data.bimRequestIdList Цикл
		МассивЭлементов.Добавить(СтрокаПараметров.ParamId);
	КонецЦикла;	 
	
	
	Запрос.УстановитьПараметр("ИдентификаторВМодели",МассивЭлементов);
	Запрос.УстановитьПараметр("НеЗаполнено",МассивЭлементов.Количество()=0);
	
	
	Запрос.УстановитьПараметр("ОбъектСтроительства", СМ_BIM_ВызовСервера.ПолучитьОбъектСтроительства(Data.BuildingObject));	
	Запрос.УстановитьПараметр("ИдентификаторПроекта",Data.BuildingObject);
	
	Результат=Запрос.Выполнить().Выгрузить();	
	ТипСтрока = ФабрикаXDTO.Тип("bimPack","bimStandard");
	ТипТаблица = ФабрикаXDTO.Тип("bimPack","bimStandardList");
	Таблица = ФабрикаXDTO.Создать(ТипТаблица);
	Для Каждого Стр Из результат Цикл
		Строка = ФабрикаXDTO.Создать(ТипСтрока);
		Строка.Name=Стр.Name;
		Строка.Metric=Стр.Metric;
		Строка.Key=Стр.Key;
		Строка.Code=Строка(Стр.Code.УникальныйИдентификатор());
		Строка.StGroup=Строка(Стр.StGroup.УникальныйИдентификатор());
		Строка.TypeLink=Стр.TypeLink;
		Строка.ParamId=Стр.ParamId;
		Строка.Book=Строка(Стр.ТипНормативногоСборника);
		Таблица.bimStandard.Добавить(Строка);
	КонецЦикла;	
	
	Возврат Таблица;
	
	
КонецФункции

Функция CreateDocs(Data)
	
	// Входной параметр Data структура вида:
	// BuildingObject 	- название проекта.
	// BimRequestList 	- список структур вида.
	// ParamName 		- название параметра.
	// ParamValue 		- значение параметра.
	// ParamId 			- идентификатор.
	// BimRequestList 	- заполняется следующим образом (списком).
	// ParamName 		- тип параметра для расчета (TypeLink).				
	// ParamValue 		- Расчетное значение параметра.				
	// ParamId 			- Ид объекта модели ренги.
	// Заполняются все элементы которые должны быть в смете (сколько смет, столько обращений к функции).
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'СМ_BIM WS'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Информация, , , "Формирование сметы");
	                                                               	
	ОбъектСтроительства = СМ_BIM_ВызовСервера.ПолучитьОбъектСтроительства(Data.BuildingObject);
	
	Попытка
		
		ТаблицаХарактеристик= ПреобразоватьХарактеристикиВТаблицуЗначений(ОбъектСтроительства,Data.bimRequestList,Data.BuildingObject);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'СМ_BIM WS'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , "Ошибка передачи параметров в сервис: "+ТекстОшибки);
		УстановитьПривилегированныйРежим(Ложь);
		Возврат "bimRequestList invalid";  
		
	КонецПопытки;
	
	Попытка
		
		Для Каждого СтрокаПараметров Из ТаблицаХарактеристик Цикл
			Запись=РегистрыСведений.СМ_BIM_ХарактеристикиОбъектов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись,СтрокаПараметров);
			Запись.Записать();
		КонецЦикла;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'СМ_BIM WS'",
		ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при записи характеристик");
		
		УстановитьПривилегированныйРежим(Ложь);
		
		return "Write/read error";
		
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Константы.СМ_BIM_ШаблонСтруктурыСметы.Получить()) Тогда
	
		Результат = СМ_BIM_ВызовСервера.СоздатьСметныйДокументПоКонструктивам(ОбъектСтроительства, Data.BuildingObject, ТаблицаХарактеристик);
		
	Иначе
		
		Результат = СМ_BIM_ВызовСервера.СоздатьСметныйДокументПоТипамКонструктивов(ОбъектСтроительства, Data.BuildingObject, ТаблицаХарактеристик);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция SetBuildingObject(Data)
		
	Попытка	
		
		МД = XMLТипЗнч(Справочники.СМ_ОбъектыСтроительства.ПустаяСсылка());
		Ссылка = XMLЗначение(ИзXMLТипа(МД), Data.ParamValue);
		
	Исключение
		
		return "Building uid invalid";
		
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_ОбъектыСтроительства.Ссылка,
	               |	1 КАК Приоритет
	               |ИЗ
	               |	Справочник.СМ_ОбъектыСтроительства КАК СМ_ОбъектыСтроительства
	               |ГДЕ
	               |	СМ_ОбъектыСтроительства.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СМ_ОбъектыСтроительства.Ссылка,
	               |	2
	               |ИЗ
	               |	Справочник.СМ_ОбъектыСтроительства КАК СМ_ОбъектыСтроительства
	               |ГДЕ
	               |	СМ_ОбъектыСтроительства.Наименование = &Наименование
	               |	И СМ_ОбъектыСтроительства.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Наименование", Ссылка.Наименование);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СсылкаВБазе = Выборка.Ссылка;
		
	ИначеЕсли ЗначениеЗаполнено(Ссылка) Тогда

		// Создаем объект в базе.
		СозданНаОснованииОбъект = Справочники.СМ_ОбъектыСтроительства.СоздатьЭлемент();

		СозданНаОснованииОбъект.УстановитьСсылкуНового(Справочники.СМ_ОбъектыСтроительства.ПолучитьСсылку(Ссылка.УникальныйИдентификатор()));
		СозданНаОснованииНезаписаннаяСсылка=СозданНаОснованииОбъект.ПолучитьСсылкуНового();
		
		//ЗаполнитьЗначенияСвойств(СозданНаОснованииОбъект, Ссылка);
		СозданНаОснованииОбъект.Наименование = ?(СозданНаОснованииОбъект.Наименование = "", "По файлу Renga "+Ссылка.УникальныйИдентификатор(), СозданНаОснованииОбъект.Наименование);
		
		СозданНаОснованииОбъект.Записать();
		
		СсылкаВБазе = СозданНаОснованииОбъект.Ссылка;  
		
	Иначе
		
		СсылкаВБазе = Справочники.СМ_ОбъектыСтроительства.ПустаяСсылка();
	
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(СсылкаВБазе) Тогда
		
		Запись=РегистрыСведений.СМ_BIM_СоответствиеОбъектов.СоздатьМенеджерЗаписи();
		Запись.ОбъектСтроительства=СсылкаВБазе;
		Запись.ИдентификаторВМодели = "File";
		Запись.ПоказательДляРасчета=Data.ParamName;
		Запись.ИдентификаторПроекта=Data.ParamValue;
		Запись.Записать();
		
		return "Ok";
		
	КонецЕсли;
	
	return "Building object no find";
	
КонецФункции

Функция GetVersion()
	Возврат "1.2.3.0";
КонецФункции

Функция GetUOM()
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СМ_ЕдиницыИзмеренияСмета.Ссылка,
	|	СМ_ЕдиницыИзмеренияСмета.Наименование
	|ИЗ
	|	Справочник.СМ_ЕдиницыИзмеренияСмета КАК СМ_ЕдиницыИзмеренияСмета
	|ГДЕ
	|	НЕ СМ_ЕдиницыИзмеренияСмета.ПометкаУдаления";
	
	Результат=Запрос.Выполнить().Выгрузить();	
	
	ТипСтрока = ФабрикаXDTO.Тип("bimPack","UOM");
	ТипТаблица = ФабрикаXDTO.Тип("bimPack","UOMList");
	Таблица = ФабрикаXDTO.Создать(ТипТаблица);
	Для Каждого Стр Из Результат Цикл
		Строка = ФабрикаXDTO.Создать(ТипСтрока);
		Строка.UOM01=Строка(Стр.Ссылка.УникальныйИдентификатор());
		Строка.UOM02=Стр.Наименование;
		Таблица.UOM.Добавить(Строка);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция GetGR()
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СМ_Ресурсы.Ссылка КАК Ссылка,
	|	СМ_Ресурсы.Родитель,
	|	СМ_Ресурсы.Наименование
	|ИЗ
	|	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	|ГДЕ
	|	НЕ СМ_Ресурсы.ПометкаУдаления
	|	И СМ_Ресурсы.ЭтоГруппа 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Результат=Запрос.Выполнить().Выгрузить();	
	
	ТипСтрока = ФабрикаXDTO.Тип("bimPack","GR");
	ТипТаблица = ФабрикаXDTO.Тип("bimPack","GRList");
	Таблица = ФабрикаXDTO.Создать(ТипТаблица);
	Для Каждого Стр Из Результат Цикл
		Строка = ФабрикаXDTO.Создать(ТипСтрока);
		Строка.GR01=Строка(Стр.Ссылка.УникальныйИдентификатор());
		Строка.GR02=?(ЗначениеЗаполнено(Стр.Родитель),Строка(Стр.Родитель.УникальныйИдентификатор()),"");
		
		Строка.GR03=Стр.Наименование;
		
		Таблица.GR.Добавить(Строка);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция GetRES(Data)
	
	
	
	
	Каталоги=Новый Массив;
	Для Каждого СтрокаПараметров Из Data.bimRequestList Цикл
		Если СтрокаПараметров.ParamName="Catalog" Тогда
			Каталоги.Добавить(СтрокаПараметров.ParamValue);
		КонецЕсли;
	КонецЦикла;
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СМ_Ресурсы.Ссылка
	|ПОМЕСТИТЬ ГруппыВТ
	|ИЗ
	|	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	|ГДЕ
	|	СМ_Ресурсы.Наименование В(&Ссылка)
	|	И СМ_Ресурсы.ЭтоГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	СМ_Ресурсы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СМ_Ресурсы.Ссылка КАК Ссылка,
	|	СМ_Ресурсы.Родитель,
	|	СМ_Ресурсы.Наименование,
	|	СМ_Ресурсы.Код,
	|	СМ_Ресурсы.ДлинноеНаименование,
	|	СМ_Ресурсы.ЕдиницаИзмерения,
	|	СМ_Ресурсы.ВидРесурса
	|ИЗ
	|	Справочник.СМ_Ресурсы КАК СМ_Ресурсы
	|ГДЕ
	|	НЕ СМ_Ресурсы.ПометкаУдаления
	|	И НЕ СМ_Ресурсы.ЭтоГруппа
	|	И (&все
	|			ИЛИ СМ_Ресурсы.Ссылка В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					Группы.Ссылка
	|				ИЗ
	|					ГруппыВТ КАК Группы))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Все",Каталоги.Количество()=0);			  
	Запрос.УстановитьПараметр("Ссылка",Каталоги);
	Результат=Запрос.Выполнить().Выгрузить();	
	
	ТипСтрока = ФабрикаXDTO.Тип("bimPack","RES");
	ТипТаблица = ФабрикаXDTO.Тип("bimPack","RESList");
	Таблица = ФабрикаXDTO.Создать(ТипТаблица);
	Для Каждого Стр Из Результат Цикл
		Строка = ФабрикаXDTO.Создать(ТипСтрока);
		Строка.RES01=Строка(Стр.Ссылка.УникальныйИдентификатор());
		Строка.RES02=?(ЗначениеЗаполнено(Стр.Родитель),Строка(Стр.Родитель.УникальныйИдентификатор()),"");
		Строка.RES03=Стр.Код;
		Строка.RES04=Стр.Наименование;
		Строка.RES05=Стр.ДлинноеНаименование;
		Строка.RES06=Строка(Стр.ЕдиницаИзмерения.УникальныйИдентификатор());
		Строка.RES07=Строка(Стр.ВидРесурса);
		
		Таблица.RES.Добавить(Строка);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция GetWGP()
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СМ_НормативныеСборники.Ссылка КАК Ссылка,
	|	СМ_НормативныеСборники.Наименование,
	|	СМ_НормативныеСборники.Родитель,
	|	СМ_НормативныеСборники.КодНормативнойРасценки
	|ИЗ
	|	Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
	|ГДЕ
	|	НЕ СМ_НормативныеСборники.ПометкаУдаления
	|	И СМ_НормативныеСборники.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Результат=Запрос.Выполнить().Выгрузить();	
	
	ТипСтрока = ФабрикаXDTO.Тип("bimPack","WGP");
	ТипТаблица = ФабрикаXDTO.Тип("bimPack","WGPList");
	Таблица = ФабрикаXDTO.Создать(ТипТаблица);
	Для Каждого Стр Из Результат Цикл
		Строка = ФабрикаXDTO.Создать(ТипСтрока);
		Строка.WGP01=Строка(Стр.Ссылка.УникальныйИдентификатор());
		Строка.WGP02=?(ЗначениеЗаполнено(Стр.Родитель),Строка(Стр.Родитель.УникальныйИдентификатор()),"");
		Строка.WGP03=Стр.Наименование;
		Таблица.WGP.Добавить(Строка);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция GetWP(Data)
	
	Каталоги=Новый Массив;
	Для Каждого СтрокаПараметров Из Data.bimRequestList Цикл
		Если СтрокаПараметров.ParamName="Catalog" Тогда
			Каталоги.Добавить(СтрокаПараметров.ParamValue);
		КонецЕсли;
	КонецЦикла;
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СМ_НормативныеСборники.Ссылка
	|ПОМЕСТИТЬ ГруппыВТ
	|ИЗ
	|	Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
	|ГДЕ
	|	СМ_НормативныеСборники.Наименование В(&Ссылка)
	|	И СМ_НормативныеСборники.ЭтоГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	СМ_НормативныеСборники.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СМ_НормативныеСборники.Ссылка КАК Ссылка,
	|	СМ_НормативныеСборники.Родитель,
	|	СМ_НормативныеСборники.Наименование,
	|	СМ_НормативныеСборники.КодНормативнойРасценки,
	|	СМ_НормативныеСборники.ДлинноеНаименование,
	|	СМ_НормативныеСборники.ЕдиницаИзмерения,
	|	СМ_НормативныеСборники.ТипНормативногоСборника
	|ИЗ
	|	Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
	|ГДЕ
	|	НЕ СМ_НормативныеСборники.ПометкаУдаления
	|	И НЕ СМ_НормативныеСборники.ЭтоГруппа
	|	И (&все
	|			ИЛИ СМ_НормативныеСборники.Ссылка В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					Группы.Ссылка
	|				ИЗ
	|					ГруппыВТ КАК Группы))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("Все",Каталоги.Количество()=0);			  
	Запрос.УстановитьПараметр("Ссылка",Каталоги);
	
	Результат=Запрос.Выполнить().Выгрузить();	
	
	ТипСтрока = ФабрикаXDTO.Тип("bimPack","WP");
	ТипТаблица = ФабрикаXDTO.Тип("bimPack","WPList");
	Таблица = ФабрикаXDTO.Создать(ТипТаблица);
	Для Каждого Стр Из Результат Цикл
		Строка = ФабрикаXDTO.Создать(ТипСтрока);
		Строка.WP01=Строка(Стр.Ссылка.УникальныйИдентификатор());
		Строка.WP02=?(ЗначениеЗаполнено(Стр.Родитель),Строка(Стр.Родитель.УникальныйИдентификатор()),"");
		Строка.WP03=Стр.КодНормативнойРасценки;
		Строка.WP04=Стр.Наименование;
		Строка.WP05=Стр.ДлинноеНаименование;
		Строка.WP06=Строка(Стр.ЕдиницаИзмерения.УникальныйИдентификатор());
		Строка.WP07=Строка(Стр.ТипНормативногоСборника);
		
		Таблица.WP.Добавить(Строка);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция GetWPR(Data)
	
	Каталоги=Новый Массив;
	Для Каждого СтрокаПараметров Из Data.bimRequestList Цикл
		Если СтрокаПараметров.ParamName="Catalog" Тогда
			Каталоги.Добавить(СтрокаПараметров.ParamValue);
		КонецЕсли;
	КонецЦикла;
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СМ_НормативныеСборники.Ссылка
	|ПОМЕСТИТЬ ГруппыВТ
	|ИЗ
	|	Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
	|ГДЕ
	|	СМ_НормативныеСборники.Наименование В(&Ссылка)
	|	И СМ_НормативныеСборники.ЭтоГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	СМ_НормативныеСборники.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СМ_НормативныеСборники.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ НормативыГруппы
	|ИЗ
	|	Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
	|ГДЕ
	|	НЕ СМ_НормативныеСборники.ПометкаУдаления
	|	И НЕ СМ_НормативныеСборники.ЭтоГруппа
	|	И (&все
	|			ИЛИ СМ_НормативныеСборники.Ссылка В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					Группы.Ссылка
	|				ИЗ
	|					ГруппыВТ КАК Группы))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СМ_НормативныеСборникиРесурсыНормативныхСборников.Ссылка КАК Ссылка,
	|	СМ_НормативныеСборникиРесурсыНормативныхСборников.Ресурс КАК Ресурс,
	|	СМ_НормативныеСборникиРесурсыНормативныхСборников.НормаРасхода
	|ИЗ
	|	Справочник.СМ_НормативныеСборники.РесурсыНормативныхСборников КАК СМ_НормативныеСборникиРесурсыНормативныхСборников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НормативыГруппы КАК НормативыГруппы
	|		ПО СМ_НормативныеСборникиРесурсыНормативныхСборников.Ссылка = НормативыГруппы.Ссылка
	|ГДЕ
	|	НЕ СМ_НормативныеСборникиРесурсыНормативныхСборников.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Ресурс";
	
	Запрос.УстановитьПараметр("Все",Каталоги.Количество()=0);			  
	Запрос.УстановитьПараметр("Ссылка",Каталоги);
	Результат=Запрос.Выполнить().Выгрузить();	
	
	ТипСтрока = ФабрикаXDTO.Тип("bimPack","WPR");
	ТипТаблица = ФабрикаXDTO.Тип("bimPack","WPRList");
	Таблица = ФабрикаXDTO.Создать(ТипТаблица);
	Для Каждого Стр Из Результат Цикл
		Строка = ФабрикаXDTO.Создать(ТипСтрока);
		Строка.WPR01=Строка(Стр.Ссылка.УникальныйИдентификатор());
		Строка.WPR02=Строка(Стр.Ресурс.УникальныйИдентификатор());
		Строка.WPR03=Стр.НормаРасхода;
		Таблица.WPR.Добавить(Строка);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеФункцииИПроцедуры

Функция ПолучитьМакетДляПоиска(Условие)
	
	СКД = Новый СхемаКомпоновкиДанных; 
	Источник = СКД.ИсточникиДанных.Добавить();
	Источник.Имя = "ЛокальнаяБаза";
	Источник.СтрокаСоединения = "";
	Источник.ТипИсточникаДанных = "Local"; 
	
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "Поиск";
	НаборДанных.ИсточникДанных = "ЛокальнаяБаза";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	
	НаборДанных.Запрос = ("ВЫБРАТЬ
	|	СМ_НормативныеСборники.Ссылка КАК Code,
	|	СМ_НормативныеСборники.Наименование КАК Name,
	|	СМ_НормативныеСборники.Родитель КАК StGroup,
	|	ЕСТЬNULL(СМ_НормативныеСборники.ЕдиницаИзмерения.Наименование, """") КАК Metric,
	|	ЕСТЬNULL(СМ_НормативныеСборники.КодНормативнойРасценки, """") КАК Key,
	|	СМ_НормативныеСборники.ТипНормативногоСборника
	|ИЗ
	|	Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
	|ГДЕ
	|	НЕ СМ_НормативныеСборники.ПометкаУдаления "+Условие);
	
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	
	НастройкиСКД = СКД.НастройкиПоУмолчанию;
	
	Группировка1     = НастройкиСКД.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Группировка1.Имя = "НС";
	
	ПолеГруппировки                = Группировка1.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));       
	ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("Code");
	ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
	ПолеГруппировки.ТипДополнения  = ТипДополненияПериодаКомпоновкиДанных.БезДополнения;
	
	ПолеГруппировки                = Группировка1.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));       
	ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("Name");
	ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
	ПолеГруппировки.ТипДополнения  = ТипДополненияПериодаКомпоновкиДанных.БезДополнения;
	
	ПолеГруппировки                = Группировка1.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));       
	ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("StGroup");
	ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
	ПолеГруппировки.ТипДополнения  = ТипДополненияПериодаКомпоновкиДанных.БезДополнения;
	
	ПолеГруппировки                = Группировка1.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));       
	ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("Metric");
	ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
	ПолеГруппировки.ТипДополнения  = ТипДополненияПериодаКомпоновкиДанных.БезДополнения;
	
	ПолеГруппировки                = Группировка1.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));       
	ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("Key");
	ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
	ПолеГруппировки.ТипДополнения  = ТипДополненияПериодаКомпоновкиДанных.БезДополнения;
	
	ПолеГруппировки                = Группировка1.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));       
	ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("ТипНормативногоСборника");
	ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
	ПолеГруппировки.ТипДополнения  = ТипДополненияПериодаКомпоновкиДанных.БезДополнения;
	
	ВыбранноеАвтоПоле = Группировка1.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));     
	ВыбранноеАвтоПоле.Использование = Истина;
	
	Возврат СКД;
КОнецФункции

Функция НайтиТипСборника(Текст) Экспорт
	
	Для каждого Знч из Метаданные.Перечисления.СМ_ТипыНормативныхСборников.ЗначенияПеречисления Цикл
		Если Знч.Синоним = Текст Тогда
			Возврат Перечисления.СМ_ТипыНормативныхСборников[Знч.Имя];
		КонецЕсли
	КонецЦикла;
	Возврат Перечисления.СМ_ТипыНормативныхСборников.ПустаяСсылка();
	
КонецФункции 

Функция ПреобразоватьПараметрыСоответствияВТаблицуЗначений(ОбъектСтроительства,bimRequestList,ИдентификаторПроекта)
	
	ТаблицаСоответствий=Новый ТаблицаЗначений;
	ТаблицаСоответствий.Колонки.Добавить("ОбъектСтроительства",Новый ОписаниеТипов("СправочникСсылка.СМ_ОбъектыСтроительства"));
	ТаблицаСоответствий.Колонки.Добавить("Шифр",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСоответствий.Колонки.Добавить("ТипНормативногоСборника",Новый ОписаниеТипов("ПеречислениеСсылка.СМ_ТипыНормативныхСборников"));
	ТаблицаСоответствий.Колонки.Добавить("ШифрРодителя",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСоответствий.Колонки.Добавить("ТипНормативногоСборникаРодителя",Новый ОписаниеТипов("ПеречислениеСсылка.СМ_ТипыНормативныхСборников"));
	ТаблицаСоответствий.Колонки.Добавить("ИдентификаторВМодели",ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаСоответствий.Колонки.Добавить("ИдентификаторРесурса",ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаСоответствий.Колонки.Добавить("ПоказательДляРасчета",ОбщегоНазначения.ОписаниеТипаСтрока(300));
	ТаблицаСоответствий.Колонки.Добавить("ИдентификаторПроекта",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСоответствий.Колонки.Добавить("ЯвляетсяРесурсом",Новый ОписаниеТипов("Булево"));
	
	ТекущийИдентификатор="";
	СтрокаСоответствий=Неопределено;
	Для Каждого СтрокаПараметров Из bimRequestList Цикл
		
		Если ТекущийИдентификатор<>СтрокаПараметров.ParamId Или СтрокаСоответствий=Неопределено Тогда
			НайденныеСтроки=ТаблицаСоответствий.НайтиСтроки(Новый Структура("ИдентификаторВМодели",СтрокаПараметров.ParamId));
			Если НайденныеСтроки.Количество()>0 Тогда
				СтрокаСоответствий=НайденныеСтроки[0];
			Иначе
				СтрокаСоответствий=ТаблицаСоответствий.Добавить();
				СтрокаСоответствий.ОбъектСтроительства=ОбъектСтроительства;
				СтрокаСоответствий.ИдентификаторВМодели=СтрокаПараметров.ParamId;
				СтрокаСоответствий.ИдентификаторПроекта=ИдентификаторПроекта;
				Если СтрокаПараметров.Свойства().Получить("ParamMaterialId") <> Неопределено Тогда
					СтрокаСоответствий.ИдентификаторРесурса=СтрокаПараметров.ParamMaterialId;
					СтрокаСоответствий.ЯвляетсяРесурсом = ЗначениеЗаполнено(СтрокаПараметров.ParamMaterialId);
				КонецЕсли;
			КонецЕсли;
			ТекущийИдентификатор=СтрокаПараметров.ParamId;
		КонецЕсли;
		
		
		
		Если СтрокаПараметров.ParamName="Shifr" Тогда
			СтрокаСоответствий.Шифр=СтрокаПараметров.ParamValue;	
		ИначеЕсли СтрокаПараметров.ParamName="Book" Тогда
			СтрокаСоответствий.ТипНормативногоСборника=НайтиТипСборника(СтрокаПараметров.ParamValue);
		ИначеЕсли СтрокаПараметров.ParamName="ShifrParent" Тогда
			СтрокаСоответствий.ШифрРодителя=СтрокаПараметров.ParamValue;	
		ИначеЕсли СтрокаПараметров.ParamName="BookParent" Тогда
			СтрокаСоответствий.ТипНормативногоСборникаРодителя=НайтиТипСборника(СтрокаПараметров.ParamValue);
		ИначеЕсли СтрокаПараметров.ParamName="CalcParam" Тогда
			СтрокаСоответствий.ПоказательДляРасчета=СтрокаПараметров.ParamValue;	 
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаСоответствий;
	
КонецФункции

Функция ПреобразоватьХарактеристикиВТаблицуЗначений(ОбъектСтроительства,bimRequestList,ИдентификаторПроекта)
	
	ТаблицаХарактеристик=Новый ТаблицаЗначений;
	ТаблицаХарактеристик.Колонки.Добавить("ОбъектСтроительства",Новый ОписаниеТипов("СправочникСсылка.СМ_ОбъектыСтроительства"));
	ТаблицаХарактеристик.Колонки.Добавить("ИдентификаторВМодели",ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаХарактеристик.Колонки.Добавить("ИдентификаторРесурса",ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаХарактеристик.Колонки.Добавить("ПоказательДляРасчета",ОбщегоНазначения.ОписаниеТипаСтрока(300));
	ТаблицаХарактеристик.Колонки.Добавить("Значение",ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ТаблицаХарактеристик.Колонки.Добавить("ЗначениеЧислом",ОбщегоНазначения.ОписаниеТипаЧисло(18,2));
	ТаблицаХарактеристик.Колонки.Добавить("ЗначениеСсылка",Новый ОписаниеТипов("СправочникСсылка.СМ_BIM_ТипыКонструктивов"));
	ТаблицаХарактеристик.Колонки.Добавить("ИдентификаторПроекта",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
	Для Каждого СтрокаПараметров Из bimRequestList Цикл
		
		СтрокаСоответствий=ТаблицаХарактеристик.Добавить();
		СтрокаСоответствий.ОбъектСтроительства=ОбъектСтроительства;
		СтрокаСоответствий.ИдентификаторВМодели=СтрокаПараметров.ParamId;
		СтрокаСоответствий.ИдентификаторРесурса=СтрокаПараметров.ParamMaterialId;
		СтрокаСоответствий.ПоказательДляРасчета=СтрокаПараметров.ParamName;
		СтрокаСоответствий.ЗначениеСсылка=Справочники.СМ_BIM_ТипыКонструктивов.ПустаяСсылка();
		Если ВРег(СтрокаПараметров.ParamName)="TYPE" Тогда
			СтрокаСоответствий.Значение=СтрокаПараметров.ParamValue;
			СтрокаЗначение = СМ_BIM_ВызовСервера.ПреобразоватьИмяКонструктива(СтрокаПараметров.ParamValue);
			СтрокаСоответствий.ЗначениеСсылка = СМ_BIM_ВызовСервера.НайтиСоздатьТипКонструктива(СтрокаЗначение);
		Иначе
			СтрокаСоответствий.Значение=СтрокаПараметров.ParamValue;
		КонецЕсли;
		СтрокаСоответствий.ЗначениеЧислом=СтрокаПараметров.ParamValue;
		СтрокаСоответствий.ИдентификаторПроекта=ИдентификаторПроекта;
		
	КонецЦикла;
	
	Возврат  ТаблицаХарактеристик;
	
КонецФункции        

#КонецОбласти
